wikimedia/smash-pig/PaymentProviders/Adyen/Tests/Data/ipn_RecurringContract.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">0</value></amount><eventCode>RECURRING_CONTRACT</eventCode><eventDate>2023-06-20T16:09:48+02:00</eventDate><merchantAccountCode>WikimediaDonations</merchantAccountCode><merchantReference>YOUR_PAYMENT_REFERENCE</merchantReference><paymentMethod>ideal</paymentMethod><pspReference>M5N7TQ4TG5PFWR50</pspReference><originalReference>INITIAL_PAYMENT_PSP_REFERENCE</originalReference><reason></reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>
