wikimedia/smash-pig-backup/PaymentProviders/Adyen/Tests/Data/ipn_Autorescue.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <sendNotification xmlns="http://notification.services.adyen.com">
      <notification>
        <live>false</live>
        <notificationItems>
          <NotificationRequestItem>
            <additionalData>
              <entry>
                <key>retry.rescueReference</key>
                <value>8826173525728789</value>
              </entry>
              <entry>
                <key>merchantOrderReference</key>
                <value>8826173525728789</value>
              </entry>
              <entry>
                <key>hmacSignature</key>
                <value>b0ea55c2fe60d4d1d605e9c385e0e7...</value>
              </entry>
            </additionalData>
            <amount>
              <currency xmlns="http://common.services.adyen.com">EUR</currency>
              <value xmlns="http://common.services.adyen.com">200</value>
            </amount>
            <eventCode>AUTORESCUE</eventCode>
            <eventDate>2021-01-01T01:00:00+01:00</eventDate>
            <merchantAccountCode>YOUR_MERCHANT_ACCOUNT</merchantAccountCode>
            <merchantReference>YOUR_MERCHANT_REFERENCE</merchantReference>
            <originalReference>9913140798220028</originalReference>
            <pspReference>YOUR_PSP_REFERENCE</pspReference>
            <reason></reason>
            <success>true</success>
          </NotificationRequestItem>
        </notificationItems>
      </notification>
    </sendNotification>
  </soap:Body>
</soap:Envelope>